app/controllers/songs_controller.rb

  def index
    if params[:artist_id] #-- if artist foreign key is in url then try to find it in database
      @artist = Artist.find_by(id: params[:artist_id])

      if @artist.nil? # -- if there is no such artist in database return to the artists page
        flash[:alert]="Artist not found"
        redirect_to artists_path
      else
        @songs = @artist.songs # if artist is found then makr all songs of the particular artist avaiable to the artist songs index page
      end

    else
      @songs = Song.all # if none of the above is successful then make avaiable an array of all the songs in the database
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]